[
    {
        "bookId": 1,
        "bookName": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "image": "https://i.ibb.co/jfyzT2G/To-Kill-a-Mockingbird.png",
        "review": "To Kill a Mockingbird is a poignant portrayal of racial injustice and moral courage in 1930s Alabama. Through the eyes of young Scout Finch, the novel explores themes of empathy, compassion, and the complexities of human nature. Harper Lee's timeless classic challenges readers to confront prejudice and uphold justice, leaving a profound impact that resonates long after the final page.",
        "totalPages": 336,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Suspense", "Psychological"],
        "publisher": "J. B. Lippincott & Co.",
        "yearOfPublishing": 1960
    },
    {
        "bookId": 2,
        "bookName": "Pride and Prejudice",
        "author": "Jane Austen",
        "image": "https://i.ibb.co/6ZzrprV/Pride-and-Prejudice.png",
        "review": "Pride and Prejudice by Jane Austen is a timeless masterpiece of romantic fiction. Set in 19th-century England, the novel follows the spirited Elizabeth Bennet as she navigates the societal expectations of marriage and love. With wit, humor, and keen observation, Austen explores themes of class, gender, and the complexities of human relationships, creating a captivating and enduring tale of love and self-discovery.",
        "totalPages": 279,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Romance", "Classic"],
        "publisher": "T. Egerton, Whitehall",
        "yearOfPublishing": 1813
    },
    {
        "bookId": 3,
        "bookName": "1984",
        "author": "George Orwell",
        "image": "https://i.ibb.co/HGJkL3x/1984.png",
        "review": "George Orwell's novels, like 1984 and Animal Farm, offer incisive critiques of authoritarianism and social injustice. Through compelling narratives and astute social analysis, Orwell unveils the perils of unchecked power and the erosion of individual freedoms. His works remain essential reading, serving as potent reminders of the importance of vigilance in defending democracy and preserving human rights.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Fiction",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Secker & Warburg",
        "yearOfPublishing": 1949
    },
    {
        "bookId": 4,
        "bookName": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "image": "https://i.ibb.co/rMwrHq4/The-Great-Gatsby.png",
        "review": "The Great Gatsby by F. Scott Fitzgerald is a dazzling portrayal of the Jazz Age and the American Dream. Set in the opulent world of Long Island in the 1920s, the novel follows Jay Gatsby's pursuit of wealth, love, and social status. With vivid prose and complex characters, Fitzgerald delves into themes of love, ambition, and the emptiness of materialism, creating a timeless classic of American literature.",
        "totalPages": 180,
        "rating": 4.6,
        "category": "Fiction",
        "tags": ["Drama", "Psychological"],
        "publisher": "Charles Scribner's Sons",
        "yearOfPublishing": 1925
    },
    {
        "bookId": 5,
        "bookName": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/L6TxRM7/The-Hobbit.png",
        "review": "The Hobbit by J.R.R. Tolkien is a captivating adventure set in Middle-earth. Bilbo Baggins, a hobbit of the Shire, embarks on a journey with Gandalf and a group of dwarves to reclaim their homeland from the dragon Smaug. Filled with magic, creatures, and heroic quests, Tolkien's enchanting tale explores themes of courage, friendship, and the power of the unexpected.",
        "totalPages": 310,
        "rating": 4.7,
        "category": "Fantasy",
        "tags": ["Adventure", "Epic"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1937
    },
    {
        "bookId": 6,
        "bookName": "The Alchemist",
        "author": "Paulo Coelho",
        "image": "https://i.ibb.co/WyhkGsh/The-Alchemist.png",
        "review": "The Alchemist by Paulo Coelho is a mesmerizing tale of self-discovery and personal legend. Santiago, a young shepherd, embarks on a journey across the desert in search of a hidden treasure. Along the way, he encounters wisdom, love, and the realization that the true treasure lies within himself. Coelho's enchanting narrative inspires readers to pursue their dreams and embrace the journey of life.",
        "totalPages": 197,
        "rating": 4.5,
        "category": "Fiction",
        "tags": ["Philosophical", "Spiritual"],
        "publisher": "HarperCollins",
        "yearOfPublishing": 1988
    },
    {
        "bookId": 7,
        "bookName": "The Lord of the Rings",
        "author": "J.R.R. Tolkien",
        "image": "https://i.ibb.co/j3Qv4Tw/The-Lord-of-the-Rings.png",
        "review": "The Alchemist by Paulo Coelho is a mesmerizing tale of self-discovery and personal legend. Santiago, a young shepherd, embarks on a journey across the desert in search of a hidden treasure. Along the way, he encounters wisdom, love, and the realization that the true treasure lies within himself. Coelho's enchanting narrative inspires readers to pursue their dreams and embrace the journey of life.",
        "totalPages": 1178,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Adventure", "Epic"],
        "publisher": "George Allen & Unwin",
        "yearOfPublishing": 1954
    },
    {
        "bookId": 8,
        "bookName": "The Catcher in the Rye",
        "author": "J.D. Salinger",
        "image": "https://i.ibb.co/GRBZHp9/The-Catcher-in-the-Rye.png",
        "review": "The Catcher in the Rye by J.D. Salinger is a poignant coming-of-age novel that follows Holden Caulfield, a disenchanted teenager navigating the complexities of adolescence in 1950s America. Through Holden's unique voice and perspective, Salinger explores themes of alienation, identity, and the loss of innocence. This timeless classic continues to resonate with readers of all generations for its raw honesty and emotional depth.",
        "totalPages": 224,
        "rating": 4.3,
        "category": "Fiction",
        "tags": ["Coming-of-Age", "Literary"],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 1951
    },
    {
        "bookId": 9,
        "bookName": "Harry Potter and the Philosopher's Stone",
        "author": "J.K. Rowling",
        "image": "https://i.ibb.co/3TQK5TD/Harry-Potter-and-the-Philosopher-s-Stone.png",
        "review": "Harry Potter and the Philosopher's Stone by J.K. Rowling is a captivating tale of magic, friendship, and adventure. Follow young Harry Potter as he discovers his wizarding heritage and enrolls in Hogwarts School of Witchcraft and Wizardry. Rowling's imaginative world-building, engaging characters, and thrilling plot twists make this fantasy novel a beloved classic for readers of all ages.",
        "totalPages": 320,
        "rating": 4.8,
        "category": "Fantasy",
        "tags": ["Wizardry", "Magic", "Adventure"],
        "publisher": "Bloomsbury Publishing",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 10,
        "bookName": "The Da Vinci Code",
        "author": "Dan Brown",
        "image": "https://i.ibb.co/Fx3Tbbn/The-Da-Vinci-Code.png",
        "review": "The Da Vinci Code by Dan Brown is a gripping thriller that unravels a centuries-old mystery. Harvard symbologist Robert Langdon finds himself entangled in a race against time to uncover the truth behind a shocking murder and a secret society's hidden agenda. Brown's fast-paced narrative, intricate puzzles, and thought-provoking revelations keep readers on the edge of their seats until the very end.",
        "totalPages": 454,
        "rating": 4.2,
        "category": "Mystery",
        "tags": ["Suspense", "Conspiracy", "Thriller"],
        "publisher": "Doubleday",
        "yearOfPublishing": 2003
    },
    {
        "bookId": 11,
        "bookName": "The Hunger Games",
        "author": "Suzanne Collins",
        "image": "https://i.ibb.co/JvK74jX/The-Hunger-Games.png",
        "review": "The Hunger Games by Suzanne Collins is a riveting dystopian novel set in a post-apocalyptic world. In the nation of Panem, Katniss Everdeen volunteers to compete in the brutal Hunger Games, where tributes fight to the death on live television. Collins' gripping storytelling, compelling characters, and social commentary on power and survival make this book a captivating and thought-provoking read.",
        "totalPages": 374,
        "rating": 4.4,
        "category": "Science Fiction",
        "tags": ["Dystopian", "Young Adult", "Action"],
        "publisher": "Scholastic Corporation",
        "yearOfPublishing": 2008
    },
    {
        "bookId": 12,
        "bookName": "Gone Girl",
        "author": "Gillian Flynn",
        "image": "https://i.ibb.co/2qWTTsh/Gone-Girl.png",
        "review": "Gone Girl by Gillian Flynn is a gripping psychological thriller that keeps readers on the edge of their seats. When Amy Dunne goes missing on her fifth wedding anniversary, suspicion falls on her husband, Nick. As the story unfolds through alternating perspectives, Flynn masterfully navigates twists and turns, challenging perceptions of truth, marriage, and the complexities of human relationships.",
        "totalPages": 422,
        "rating": 4.6,
        "category": "Mystery",
        "tags": ["Suspense", "Psychological"],
        "publisher": "Crown Publishing Group",
        "yearOfPublishing": 2012
    }
]
